Repository: aminszo/woocommerce-order-telegram-notifier-plugin
Catalog: languages/telegram-order-notification-*.po
Languages: fa_ir

source: Telegram Order Notification
fa_ir: اطلاع رسانی سفارشات در تلگرام

source: Sends WooCommerce order details to Telegram when a new order is placed.
fa_ir: جزئیات سفارش های جدید ووکامرس را به تلگرام ارسال میکند.

source: Amin SalehiZade
fa_ir: امین صالحی زاده

source: Telegram Notifications
fa_ir: نوتیفیکیشن تلگرام

source: The status of the order
fa_ir: وضعیت سفارش

source: The unique ID of the order
fa_ir: آیدی سفارش

source: The date the order was placed
fa_ir: تاریخ ثبت سفارش

source: The buyer's full name
fa_ir: اسم کامل خریدار

source: The full shipping address
fa_ir: آدرس کامل پستی

source: The postal code for shipping
fa_ir: کد پستی

source: The buyer's phone number
fa_ir: شماره تلفن خریدار

source: The payment method used to pay this order
fa_ir: روش پرداخت استفاده شده

source: The shipping method chosen
fa_ir: روش حمل و نقل انتخاب شده

source: Any note added by the customer
fa_ir: یادداشت اضافه شده توسط مشتری

source: The total payment amount
fa_ir: کل مبلغ پرداختی

source: The total shipping cost
fa_ir: کل هزینه حمل و نقل

source: A list of items ordered
fa_ir: لیست اقلام سفارش داده شده

source: A divider line (multiple dashes) for message readability
fa_ir: جداکننده (چند خط تیره) برای خوانایی پیام

source: Security check failed!
fa_ir: بررسی امنیتی شکست خورد!

source: Invalid URL for the middleman endpoint. Please enter a valid URL.
fa_ir: URL نامعتبر برای آدرس واسطه. لطفاً یک URL معتبر وارد کنید.

source: Invalid options for order statuses.
fa_ir: گزینه های نامعتبر برای وضعیت سفارش.

source: Settings saved!
fa_ir: تنظیمات ذخیره شد!

source: Order {order_id} placed by {buyer_name} for a total of {total}.
fa_ir: سفارش {order_id} توسط {buyer_name} به مبلغ {total} ثبت شد.

source: Telegram Notifications Settings
fa_ir: تنظیمات نوتیفیکشن تلگرام

source: Telegram Bot API Token
fa_ir: توکن API ربات تلگرام

source: Telegram Chat ID
fa_ir: آیدی چت تلگرام

source: Send message when order is :
fa_ir: ارسال پیام برای سفارش های :

source: On hold
fa_ir: در انتظار

source: Processing
fa_ir: در حال انجام

source: Cancelled
fa_ir: لغو شده

source: Failed
fa_ir: ناموفق

source: Send request to telegram api using a middleman :
fa_ir: ارسال درخواست به api تلگرام با استفاده از واسطه:

source: This option allows you to route requests to the Telegram API through an intermediary service (middleman).
fa_ir: این گزینه به شما اجازه می دهد تا درخواست ها را از طریق یک سرویس واسطه به API تلگرام بفرستید.

source: Enabling this can be useful if direct access to the Telegram API is restricted in your server.
fa_ir: اگر دسترسی مستقیم به API تلگرام در سرور شما محدود شده باشد، فعال کردن این گزینه میتواند مفید باشد.

source: After enabling, you will need to specify the middleman endpoint you want to use.
fa_ir: پس از فعال کردن، باید آدرس واسطه ای را که می خواهید استفاده کنید، مشخص کنید.

source: Middleman Endpoint
fa_ir: آدرس واسطه ارسال پیام

source: Message Template
fa_ir: الگوی پیام

source: Customize the message format that will be sent to Telegram. Use the following placeholders to insert order details dynamically:
fa_ir: فرمت پیامی که به تلگرام ارسال می شود را سفارشی کنید. از متغیرهای زیر برای درج جزئیات سفارش استفاده کنید:

source: Save Settings
fa_ir: ذخیره تنظیمات
